//
//  XFIconmanager.m
//  youwuquan
//
//  Created by mr.zhou on 2017/11/16.
//  Copyright © 2017年 mr.zhou. All rights reserved.
//

#import "XFIconmanager.h"

@implementation XFIconmanager
+ (instancetype)sharedManager {
    
    static dispatch_once_t onceToken;
    static XFIconmanager *manager;
    dispatch_once(&onceToken, ^{
        manager = [[XFIconmanager alloc] init];
        
    });
    return manager;
}

- (instancetype)init {
    
    if (self = [super init]) {
     
        _authIcons = @[@"A",@"C",@"D",@"F",@"H",@"M",@"P",@"V",@"R",@"S",@"T"];
        
        _headImages = @[@"message_touxiang",@"messages_tou2",@"find_tou1",@"find_icon2",@"find_icon3",@"find_icon4",@"find_icon5"];
        
        _findImages = @[@"test1",@"test2"];
        
        _homeImages = @[@"11",@"12",@"13",@"14",@"15",@"16",@"17",@"18",@"19",@"20",@"21",@"22",@"23",@"24",@"9",@"31",@"32",@"33",@"34",@"35",@"36",@"37",@"38",@"39",@"40",@"41",@"42",@"43",@"44",@"45",@"46",@"47",@"48",@"49",@"50",@"51",@"52",@"53",@"54",@"55",@"56",@"57",@"58",@"59",@"60",@"61"];
        
        _hdIimages = @[@"find_banner",@"home_T1",@"home_T2"];
        
        _videoPics = @[@"0",@"0(1)",@"0(2)",@"0(3)",@"0(4)",@"0(5)",@"0(6)",@"0(7)",@"0(8)",@"0(9)",@"0(10)",@"0(11)",@"0(12)",@"0(13)",@"0(14)",@"0(15)",@"0(16)",@"0(17)",@"0(18)",@"0(19)"];
        
        _comments = @[@"我有位家境一般的朋友，一直觉得如果自己有钱一定会更幸福。后来他妈做婴幼教育发财了。快十年后我见他，问：现在你倒是有钱了，你真的幸福吗？他回答：爽翻啦！我默默地走开了。",@"只有能力强会被当成纯技术人员；而光会社交拍马又会被认为没有真才实学；所以，要想在单位中脱颖而出，最重要的是有关系。",@"小孩问富翁：叔叔为什么你这么有钱呢？富翁说：我给你讲个故事吧。很小的时候，我注意到楼下的矿泉水卖一块钱，而三站地外的篮球场上，要卖一块五。我拿着一个大书包，从楼下买水带到球场去卖，卖一块二。一个月我挣了十块钱。小孩说：我好像明白了。富翁说：你明白个屁。后来我爸死了，把钱留给我了。",@"优秀的女生在脆弱的时候(比如分手，工作不如意)，会需要比平时更多的关爱，于是会和更多的人交流。如果她在恢复正常后，回到了自己原来的圈子，不再理你，请你不要奇怪。",@"有些年轻人，一毕业就到某些大型国企和机关中工作。每天没什么事儿，就是吃饭喝酒，福利好得不得了。人生还没有奋斗过就开始养老，自己的理想被丢在一旁，用民脂民膏来享受特权。对于这样的年轻人，我只想问你们四个字：哪投简历？",@"爱情开始时都差不多。但当两个人平淡到左手牵右手时，是加班挤地铁还房贷然后给他农村父母寄钱假期在屋里大眼瞪小眼，还是开小车朝九晚五住大房子周末采购装点自己的小家出国旅游，区别就非常大了。",@"路上看到两个长得不好看也看起来很穷的男女热吻。我说两个物质生活质量很差的人，彼此相伴。朋友立刻反驳我：物质生活质量不行就不会幸福吗？他们如此相爱，比那些有钱又美但离婚的名人强多了！我说我根本没说他们不幸福呀，你努力反驳的，可能是你自己内心的声音吧。",@"我有一些漂亮又受过教育的姐妹，本来有机会嫁给官富二代，但很多被那些长得不错、有名校高学历、刚毕业在知名外企工作、加班到很晚还健身的男生所吸引。觉得人家上进又有潜力。五六年后，她们悔得肠子都青了。",@"几年前BBS有女生写道：不知为什么，每次有丑男看我，我都感觉他很猥琐，特别反感；但帅哥看我就感觉很好。今日又看到有男生写：我发现我老是喜欢抢着给漂亮的女生帮忙，不自觉地就会问她需要什么；但每次丑女让我帮忙，我就感觉：你自己不会干吗？——一些很明显的实话说出来，显得格外可爱。"];
        
        _names = @[@"啦啦啦呜呜呜呵",@"丸滋",@"残阳暮雪",@"走三步退两步",@"派大星",@"海绵宝宝",@"谢老板",@"痞老板",@"麦兜",@"海尔兄弟",@"黑猫警长",@"hellokitty",@"维尼熊",@"卡卡西",@"赤木晴子",@"流川枫",@"樱木花道"];
        
        _pingluns = @[@"我想变成你。见你所见，爱你所爱。I want to be what you See what you see , love what you love .",@"很多人喜欢旅游分享经验，看着他们把钱花光出去走一趟，回来后生活还是没有任何改变，我就放心了。",@"失败是成功之母，可惜成功六亲不认",@"上帝为你关上一道防盗门，同时还给你上了一把钛合金锁。",@"有什么好悲伤的？人生不就是起起落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落落的吗？",@"你只看到别人在表面上活得春风得意，却不知道人家在背后也过得也风生水起。",@"注重细节，从小事做起，因为你根本做不了大事。",@"你无法叫醒一个不回你消息的人，但是红包能。",@"谁说我不会乐器？我退堂鼓打的可好了",@"生活不止眼前的苟且，还有前任发来的请帖。",@"有时候你会觉得自己就是个sb，别灰心，至少感觉是对的。",@"别人的脸是七分天注定，三分靠打扮，你的脸是一分天注定，九分靠滤镜。",@".丑小鸭能变天鹅不是因为它多努力，是因为它爸妈本来就是天鹅。",@"童话里的灰姑娘虽然穷，但都很漂亮，你漂亮吗？"];
        
    }
    return self;
}


@end
